src/cfe/Documents/кбп_Замещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>кбп_Замещение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.кбп_Замещения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Замещаемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замещающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбластьДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_ОбластиЗамещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлятьЗамещаемого</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВернутьЗадачиПоОкончании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.кбп_РолиИсполнителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Схемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Схема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.кбп_СхемыПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/InformationRegisters/кбп_Замещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>кбп_Замещения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Уведомлять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозвращатьЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Замещаемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Замещающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_СхемыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/Enums/кбп_ОбластиЗамещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>кбп_ОбластиЗамещения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Все</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Роли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Схемы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_СобытияПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_СобытияПроцессов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗадачаНазначена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокИстекает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачаПросрочена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачаВыполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНаДоработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НовыйКомментарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упоминание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцессЗапущен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцессЗавершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцессПрерван</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамещениеНачалось</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамещениеЗакончилось</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобытиеШага</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дайджест</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводкаЗадач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОПросрочках</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Documents/кбп_Замещение/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ОбластьДействия) Тогда
		ОбластьДействия = Перечисления.кбп_ОбластиЗамещения.Все;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = кбп_АдаптерКонфигурации.ТекущийПользователь();
	КонецЕсли;
	УведомлятьЗамещаемого = Истина;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Не ЗначениеЗаполнено(Замещаемый) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Укажите, кого замещают.'"), ЭтотОбъект, "Замещаемый", , Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Замещающий) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Укажите, кто замещает.'"), ЭтотОбъект, "Замещающий", , Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Укажите дату начала.'"), ЭтотОбъект, "ДатаНачала", , Отказ);
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Если Замещаемый = Замещающий Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Пользователь не может замещать сам себя.'"), ЭтотОбъект,
			"Замещающий", , Отказ);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаОкончания) И ДатаОкончания < ДатаНачала Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Дата окончания раньше даты начала.'"), ЭтотОбъект,
			"ДатаОкончания", , Отказ);
	КонецЕсли;
	Области = Перечисления.кбп_ОбластиЗамещения;
	Если ОбластьДействия = Области.Роли И Роли.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Укажите роли, на которые распространяется замещение.'"),
			ЭтотОбъект, "Роли", , Отказ);
	ИначеЕсли ОбластьДействия = Области.Схемы И Схемы.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Укажите схемы, на которые распространяется замещение.'"),
			ЭтотОбъект, "Схемы", , Отказ);
	КонецЕсли;

	// Циклы запрещены (ФТ-306): замещаемый не должен уже (в том числе цепочкой) замещать замещающего.
	Для Каждого НаДату Из ДатыПроверкиЦикла() Цикл
		Замещаемые = кбп_Адресация.ЗамещаемыеПользователем(Замещаемый, НаДату);
		Если Замещаемые.Найти(Замещающий, "Замещаемый") <> Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
				НСтр("ru = '%1 уже замещает %2 (%3) — получится цикл замещений.'"), Замещаемый, Замещающий,
				Формат(НаДату, "ДЛФ=D")), ЭтотОбъект, "Замещающий", , Отказ);
			Прервать;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = кбп_АдаптерКонфигурации.ТекущийПользователь();
	КонецЕсли;
	Если ОбластьДействия <> Перечисления.кбп_ОбластиЗамещения.Роли Тогда
		Роли.Очистить();
	КонецЕсли;
	Если ОбластьДействия <> Перечисления.кбп_ОбластиЗамещения.Схемы Тогда
		Схемы.Очистить();
	КонецЕсли;

КонецПроцедуры

// Движения кбп_Замещения по каждой роли или схеме области действия; пустые Роль и Схема — «все».
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.кбп_Замещения.Записывать = Истина;
	Окончание = ДатаОкончания;
	Если ЗначениеЗаполнено(Окончание) И Окончание = НачалоДня(Окончание) Тогда
		Окончание = КонецДня(Окончание); // дата без времени — замещение действует весь последний день
	КонецЕсли;
	Области = Перечисления.кбп_ОбластиЗамещения;
	Строки = Новый Массив;
	Если ОбластьДействия = Области.Роли Тогда
		Для Каждого СтрокаРоли Из Роли Цикл
			Строки.Добавить(Новый Структура("Роль, Схема", СтрокаРоли.Роль, Справочники.кбп_СхемыПроцессов.ПустаяСсылка()));
		КонецЦикла;
	ИначеЕсли ОбластьДействия = Области.Схемы Тогда
		Для Каждого СтрокаСхемы Из Схемы Цикл
			Строки.Добавить(Новый Структура("Роль, Схема", Справочники.кбп_РолиИсполнителей.ПустаяСсылка(), СтрокаСхемы.Схема));
		КонецЦикла;
	Иначе
		Строки.Добавить(Новый Структура("Роль, Схема",
			Справочники.кбп_РолиИсполнителей.ПустаяСсылка(), Справочники.кбп_СхемыПроцессов.ПустаяСсылка()));
	КонецЕсли;
	Для Каждого Область Из Строки Цикл
		Движение = Движения.кбп_Замещения.Добавить();
		Движение.Замещаемый = Замещаемый;
		Движение.Замещающий = Замещающий;
		Движение.Роль = Область.Роль;
		Движение.Схема = Область.Схема;
		Движение.ДатаНачала = ДатаНачала;
		Движение.ДатаОкончания = Окончание;
		Движение.Уведомлять = УведомлятьЗамещаемого;
		Движение.ВозвращатьЗадачи = ВернутьЗадачиПоОкончании;
	КонецЦикла;

	кбп_Оповещения.ОповеститьОЗамещении(Ссылка, Перечисления.кбп_СобытияПроцессов.ЗамещениеНачалось);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДатыПроверкиЦикла()

	Даты = Новый Массив;
	Даты.Добавить(ДатаНачала);
	Сейчас = ТекущаяДатаСеанса();
	Если Сейчас > ДатаНачала И (Не ЗначениеЗаполнено(ДатаОкончания) Или Сейчас < КонецДня(ДатаОкончания)) Тогда
		Даты.Добавить(Сейчас);
	КонецЕсли;
	Возврат Даты;

КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
